<template>
    <div id="main4">
        部队编成
    </div>
</template>

<script>
let myChart = ""
let option = {}
export default {
    props: {
        width: Number
    },
    data() {
        return {
            dateList: ["2016-01", "2016-02", "2016-03", "2016-04", "2016-05", "2016-06", "2016-07", "2016-08", "2016-09", "2016-10", "2016-11", "2016-12","2017-01", "2017-02", "2017-03", "2017-04", "2017-05", "2017-06", "2017-07", "2017-08", "2017-09", "2017-10", "2017-11", "2017-12", "2018-01", "2018-02", "2018-03", "2018-04", "2018-05", "2018-06", "2018-07", "2018-08", "2018-09", "2018-10", "2018-11", "2018-12","2019-01", "2019-02", "2019-03", "2019-04", "2019-05", "2019-06", "2019-07", "2019-08", "2019-09", "2019-10", "2019-11", "2019-12","2020-01", "2020-02", "2020-03", "2020-04", "2020-05", "2020-06", "2020-07", "2020-08", "2020-09", "2020-10", "2020-11", "2020-12",],
            valueList: [116, 129, 135, 86, 73, 85, 73, 68, 92, 130, 245, 139, 115, 111, 309, 206, 137, 128, 85, 94, 71, 106, 84, 93, 85, 73, 83, 125, 107, 82, 44, 72, 106, 107, 66, 91, 92, 113, 107, 131, 111, 64, 69, 88, 77, 83, 111, 57, 55, 60],
            option: {
                title: {
                    // subtext: 'Demo'
                },
                tooltip: {
                },
                legend: {
                    show: true,
                    textStyle: {
                        fontSize: 10
                    },
                    type: 'scroll',
                    data: ['武警部队团级以上建制单位数量','武警部队机动总队团级以上单位数量','武警部队内卫总队团及以上单位数量','武警部队海警总队团级以上单位数量','武警部队院校建制单位数量','武警部队科研机构建制单位数量','武警部队训练机构建制单位数量','武警部队直属建制单位数量','武警部队附属建制单位数量','武警部队机关局单位数量','武警部队机关处单位数量',],
                    // selected: {
                    //     '武警部队机动总队团级以上单位数量': false,
                    //     '武警部队内卫总队团及以上单位数量': false,
                    //     '武警部队海警总队团级以上单位数量': false,
                    //     '武警部队院校建制单位数量': false,
                    //     '武警部队科研机构建制单位数量': false,
                    //     '武警部队训练机构建制单位数量': false,
                    //     '武警部队直属建制单位数量': false,
                    //     '武警部队附属建制单位数量': false,
                    //     '武警部队机关局单位数量': false,
                    //     '武警部队机关处单位数量': false
                    // }
                },
                tooltip: {
                    trigger: 'item',
                    formatter: '{a} <br/>{b}: {c}个 '
                },
                xAxis: {
                    // type: "log",
                    // data: dateList,
                    data: [],
                    splitLine: {
                        show: false
                    }
                },
                yAxis: {
                    name: "个",
                },
                series: [
                    {
                        name: '武警部队团级以上建制单位数量',
                        type: 'bar',
                        stack: 'a',
                        data: [116, 129, 135, 86, 73, 85, 73, 68, 92, 130, 245, 139, 115, 111, 309, 206, 137, 128, 85, 94, 71, 106, 84, 93, 85, 73, 83, 125, 107, 82, 44, 72, 106, 107, 66, 91, 92, 113, 107, 131, 111, 64, 69, 88, 77, 83, 111, 57, 55, 60,137, 128, 85, 94, 71, 106, 84, 93, 85, 73],
                        animationDelay: function (idx) {
                            return idx * 10;
                        }
                    },
                    { 
                        name: '武警部队机动总队团级以上单位数量',
                        type: 'bar',
                        stack: 'a',
                        data: [44, 55, 57, 60, 64, 66, 68, 69, 71, 71, 72, 73, 73, 73, 73, 77, 82, 83, 83, 84, 84, 85, 85, 85, 85, 85, 86, 88, 91, 92, 92, 93, 93, 94, 94, 106, 106, 106, 107, 107, 107, 111, 111, 111, 113, 115, 116, 125, 128, 128, 129, 130, 131, 135, 137, 137, 139, 206, 245, 309],
                        animationDelay: function (idx) {
                            return idx * 10;
                        }
                    },
                    {
                        name: '武警部队内卫总队团及以上单位数量',
                        type: 'bar',
                        stack: 'a',
                        data: [262, 262, 262, 262, 262, 262, 262, 262, 262, 262, 262, 262, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98],
                        animationDelay: function (idx) {
                            return idx * 10;
                        }
                    },
                    { 
                        name: '武警部队海警总队团级以上单位数量',
                        type: 'bar',
                        stack: 'a',
                        data: [22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 22, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98, 98],
                        animationDelay: function (idx) {
                            return idx * 10;
                        }
                    },
                    { 
                        name: '武警部队院校建制单位数量',
                        type: 'bar',
                        stack: 'a',
                        data: [31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31, 31],
                        animationDelay: function (idx) {
                            return idx * 10;
                        }
                    },
                    // { 
                    //     name: '武警部队科研机构建制单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117, 117], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // },
                    // { 
                    //     name: '武警部队训练机构建制单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50, 50], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // },
                    // { 
                    //     name: '武警部队直属建制单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // },
                    // { 
                    //     name: '武警部队附属建制单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 30, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25, 25], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // },
                    // { 
                    //     name: '武警部队机关局单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28, 28], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // },
                    // { 
                    //     name: '武警部队机关处单位数量', 
                    //     type: 'bar',
                    //     stack: 'a',
                    //     data: [67, 67, 67, 67, 67, 67, 67, 67, 67, 67, 67, 67, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63, 63], 
                    //     animationDelay: function (idx) {
                    //         return idx * 10;
                    //     }
                    // }
                ],
                animationEasing: 'elasticOut',
                animationDelayUpdate: function (idx) {
                    return idx * 5;
                }
            }
        }
    },
    methods: {
        draw: function(){
            const { dateList, valueList,option } = this
            myChart = this.$echarts.init(document.getElementById("main4"))
            myChart.setOption(option)
        }
    },
    mounted() {
        let {dateList, option} = this
        option.xAxis.data = dateList
        // this.data.map(function (item, index) {
        //     dateList.push(item[0]);
        //     valueList.push(item[1]);
        // })
        this.draw()

        const legend = {
            show: false
        } 
          
        if(this.width <= 470) {
            option.legend = legend
            // myChart.resize()
            myChart.setOption(option)
        }
    },
}
</script>

<style scoped>
    #main4 {
        width: 100%;
        height: 100%;
    }
</style>